NACA0012/nacaAirfoil_n0012familyI.5.hex_gmesh/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{

    QUAD_bdy____1
    {
        type            empty;
    }

    QUAD_bdy____2
    {
        type            empty;
    }

    QUAD_bdy____3
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    QUAD_bdy____4
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    QUAD_bdy____5
    {
        type            zeroGradient;
    }

    QUAD_bdy____6
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
}

// ************************************************************************* //
